# Дан список чисел. Определите, сколько в нем встречается различных чисел.
# Input: [1, 1, 2, 0, -1, 3, 4, 4]
# Output: 6

# a = [1, 1, 2, 0, -1, 3, 4, 4]
# b = set(a)
# c = len(b)
# print(c)


# Дана последовательность из N целых чисел и число K. Необходимо сдвинуть всю последовательность
# (сдвиг - циклический) на K элементов вправо,  K – положительное число.
# Input:   [1, 2, 3, 4, 5] k = 2
# Output:  [4, 5, 1, 2, 3]

# a = [1, 2, 3, 4, 5]
# k = 2
#
# for i in range(k):
#     a.insert(0,a.pop(-1))
# print(a)

# for i in range(len(a)-k):
#     a[i], a[i + k] = a[i + k], a[i]
# print(a)


# Напишите программу для печати всех уникальных значений в словаре.
#
# Input:  [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII": " S005 "},
# {" V ":" S009 "}, {" VIII ":" S007 "}]
#
# Output: {'S005', 'S002', 'S007', 'S001', 'S009'}


h = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII": " S005 "},
{" V ":" S009 "}, {" VIII ":" S007 "}]
print(h)

s = set()
for i in h:
    s.add(i.s)
print(s)
for val in set(h.values()):
    print(val)

    # Дан массив, состоящий из целых чисел.Напишите программу, которая
    # подсчитает количество элементов массива, больших предыдущего(элемента
    # с предыдущим номером)
    # Input: [0, -1, 5, 2, 3]
    # Output: 2
    # Пояснение: (-1 < 5, 2 < 3)

# m = [0, -1, 5, 2, 3,4,7,8]
# i = 1
# count = 0
# for i in range(len(m)):
#     if m[i] > m[i - 1]:
#         count += 1
# print(count)
